sercankuslu/astromonty/Programms/PIC18F97J60/TCPIP Demo App/MainDemo.c
// Private helper functions.
// These may or may not be present in all applications.
static void InitAppConfig(void);
static void InitializeBoard(void);
static void ProcessIO(void);
static void UpdateKey();
static void InitTimerAndPWM();

#if defined(WF_CS_TRIS)
    static void WF_Connect(void);
#endif

void LCDUpdate(void){	
    if(PIR1bits.TMR1IF) {	    
        DisplayDraw(add1);
        PIR1bits.TMR1IF = 0;
    }
}


void UpdateKey()
{
    BYTE i;
    BYTE j;		
    static BYTE a = 0;
    static BYTE b = 0;
    static BYTE k = 0;
    TRISBbits.TRISB1 = 1;
    TRISBbits.TRISB2 = 1;
    TRISBbits.TRISB3 = 1;
    TRISBbits.TRISB4 = 1;
    TRISDbits.TRISD0 = 0;
    TRISDbits.TRISD1 = 0;
    TRISDbits.TRISD2 = 0;
    TRISBbits.TRISB5 = 0;
    LATD = 0;
	LATBbits.LATB1 = 0;
	LATBbits.LATB2 = 0;
	LATBbits.LATB3 = 0;
	LATBbits.LATB4 = 0;
	LATBbits.LATB5 = 0;
	
	LATDbits.LATD0 = 1; // первая строка (menu и enter)
	Nop();Nop();
	CKeys.enter = PORTBbits.RB1^0x01;
	CKeys.menu = PORTBbits.RB3^0x01;	
	LATDbits.LATD0 = 0; // первая строка (menu и enter)	
	Nop();
	LATDbits.LATD1 = 1; // первая строка (menu и enter)
	Nop();Nop();
	CKeys.left = PORTBbits.RB1;
	CKeys.right = PORTBbits.RB2;	
	CKeys.up = PORTBbits.RB3;
	CKeys.down = PORTBbits.RB4;	
	LATDbits.LATD1 = 0; // первая строка (menu и enter)	
	Nop();
		
}

//
// PIC18 Interrupt Service Routines
// 
// NOTE: Several PICs, including the PIC18F4620 revision A3 have a RETFIE FAST/MOVFF bug
// The interruptlow keyword is used to work around the bug when using C18
#if defined(__18CXX)
	#if defined(HI_TECH_C)
	void interrupt low_priority LowISR(void)
	#else
	#pragma interruptlow LowISR
	void LowISR(void)
	#endif
	{
	   	TickUpdate(); 	          
	}
	
	#if defined(HI_TECH_C)
	void interrupt HighISR(void)
	#else
	#pragma interruptlow HighISR
	void HighISR(void)
	#endif
	{
	    //TickUpdate();
		//LCDUpdate();  			    
	}

	#if !defined(HI_TECH_C)
	#pragma code lowVector=0x18
	void LowVector(void){_asm goto LowISR _endasm}
	#pragma code highVector=0x8
	void HighVector(void){_asm goto HighISR _endasm}
	#pragma code // Return to default code section
	#endif

// C30 and C32 Exception Handlers
// If your code gets here, you either tried to read or write
// a NULL pointer, or your application overflowed the stack
// by having too many local variables or parameters declared.
#elif defined(__C30__)
	void _ISR __attribute__((__no_auto_psv__)) _AddressError(void)
	{
	    Nop();
		Nop();
	}
	void _ISR __attribute__((__no_auto_psv__)) _StackError(void)
	{
	    Nop();
		Nop();
	}
	
#elif defined(__C32__)
	void _general_exception_handler(unsigned cause, unsigned status)
	{
		Nop();
		Nop();
	}
#endif

void InitTimerAndPWM()
{
	//CCP5
	char period=0x00;
    unsigned char outputconfig=0;
    unsigned char outputmode=0;
    unsigned char config=0;
    unsigned int duty_cycle=0;
    //Timer0
    unsigned char config0=0x00;
    unsigned int timer0_value=0x00;
    //Timer1    
    unsigned char config1=0x00;
    unsigned int timer1_value=0x00;
    //Timer2    
    unsigned char config2=0x00;
    unsigned int timer2_value=0x00;
    //----Configure Timer1----
    //timer1_value = 0x00;    
    //WriteTimer1(timer1_value);            //clear timer if previously contains any value
        
    //config1 =  TIMER_INT_ON|T1_16BIT_RW|T1_SOURCE_INT|T1_PS_1_8|T1_OSC1EN_OFF|T1_SYNC_EXT_OFF;
    //OpenTimer1(config1);                //API configures the tmer1 as per user defined parameters
    //IPR1bits.TMR1IP = 0; // HIGH
    //PIR1bits.TMR1IF = 0; 
    //PIE1bits.TMR1IE = 1;
    
    //----Configure Timer2----
    timer2_value = 0x00;    
    WriteTimer2(timer2_value);            //clear timer if previously contains any value

    config2 =  T2_POST_1_16 | T2_PS_1_16 | TIMER_INT_OFF;
    OpenTimer2(config2);                //API configures the tmer1 as per user defined parameters

    SetTmrCCPSrc(T12_SOURCE_CCP);
    PIE1bits.TMR2IE = 0;
    //----Configure pwm ----
    period = 0xFF;
    OpenPWM5( period);            //Configure PWM module and initialize PWM period

    //-----set duty cycle----
    duty_cycle = 0x0F00;
    SetDCPWM5(duty_cycle);        //set the duty cycle
}
//
// Main application entry point.
//
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{
	static DWORD t = 0;
	static DWORD t1 = 0;
	static DWORD displayup = 0;
	static DWORD dwLastIP = 0;
	static DWORD tt = 0;
    static int x = 0;
    static int y = 0;
    static int x1 = 0;
    static int y1 = 0;
    static int sx1 = 2;
    static int sy1 = 2;
    static BYTE RBuffer[30];	
    BYTE K = 0;
    ST_ATTRIBUTE ReceivePacket = {
		0, 0, RBuffer
	};
	    
    BYTE count;    
	UpdateKey();
	
    memset(RBuffer, 0, sizeof(RBuffer));    
    pcfLCDInit(add1);
    DisplayInit();
    ProcessMenu(&K);
    DisplayDraw(add1);
    InitializeBoard();
    
    

	
	// Initialize stack-related hardware components that may be 
	// required by the UART configuration routines
    TickInit();
	#if defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)
	MPFSInit();
	#endif

	// Initialize Stack and application related NV variables into AppConfig.
	InitAppConfig();
	
    // Initiates board setup process if button is depressed 
	// on startup
    if(BUTTON0_IO == 0u)
    {
		#if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)
		// Invalidate the EEPROM contents if BUTTON0 is held down for more than 4 seconds
		DWORD StartTime = TickGet();
		LED_PUT(0x00);
				
		while(BUTTON0_IO == 0u)
		{
			if(TickGet() - StartTime > 4*TICK_SECOND)
			{
				#if defined(EEPROM_CS_TRIS)
			    XEEBeginWrite(0x0000);
			    XEEWrite(0xFF);
			    XEEWrite(0xFF);
			    XEEEndWrite();
			    #elif defined(SPIFLASH_CS_TRIS)
			    SPIFlashBeginWrite(0x0000);
			    SPIFlashWrite(0xFF);
			    SPIFlashWrite(0xFF);
			    #endif
			    
				#if defined(STACK_USE_UART)
				putrsUART("\r\n\r\nBUTTON0 held for more than 4 seconds.  Default settings restored.\r\n\r\n");
				#endif

				LED_PUT(0x0F);
				while((LONG)(TickGet() - StartTime) <= (LONG)(9*TICK_SECOND/2));
				LED_PUT(0x00);
				while(BUTTON0_IO == 0u);
				Reset();
				break;
			}
		}
		#endif

		#if defined(STACK_USE_UART)
        DoUARTConfig();
		#endif
    }

	// Initialize core stack layers (MAC, ARP, TCP, UDP) and
	// application modules (HTTP, SNMP, etc.)
    StackInit();

